export const NAME_REGEX =
  /^[A-Za-zÀÁÃẢẠÂẦẤẪẨẬĂẮẰẴẲẶĐÉÈẼẺẸÊẾỀỄỂỆÍÌĨỈỊÓÒÕỌÔỐỒỖỔỘƠỚỜỠỞỢÊẾỀỄỂỆÚÙŨỦỤƯỨỪỮỬỰÝỲỸỶỴàáãảạâầấẩậăắằẵẳặđéèẽẻẹêếềễểệíìĩỉịóòõỏọôốồỗổộơớờỡởợêếềễểệúùũủụưứừữửựýỳỹỷỵ\s]+$/;

export const EMAIL_REGEX =
  /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|.(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;

export const NUMBER_REGEX = /^-?(0|[1-9]\d*)?\.?\d{0,9}$/;

export const PHONE_REGEX = /^0(3[2-9]|5[6|8|9]|7[06-9]|8[1-5]|9[0-9])[0-9]{7}$/;
